In [14]:
df.iloc[3:8]

  Student ID First Name Last Name  Age Grade       Course
3     STD004      Sarah     Brown   20     A   Psychology
4     STD005      David    Miller   22     B  Mathematics
5     STD006    Jessica     Davis   19    A+      Physics
6     STD007     Daniel  Anderson   21    B-    Chemistry
7     STD008       Lisa    Wilson   20    A-      Biology

In [13]:
df.iloc[9]

Student ID                STD010
First Name                Rachel
Last Name               Martinez
Age                           21
Grade                          A
Course        English Literature
Name: 9, dtype: object

In [12]:
df[['First Name', 'Last Name']]

  First Name Last Name
0       John     Smith
1      Emily   Johnson
2    Michael  Williams
3      Sarah     Brown
4      David    Miller
5    Jessica     Davis
6     Daniel  Anderson
7       Lisa    Wilson
8      James    Taylor
9     Rachel  Martinez

In [11]:
df['First Name']

0       John
1      Emily
2    Michael
3      Sarah
4      David
5    Jessica
6     Daniel
7       Lisa
8      James
9     Rachel
Name: First Name, dtype: object

In [10]:
df['Student ID']

0    STD001
1    STD002
2    STD003
3    STD004
4    STD005
5    STD006
6    STD007
7    STD008
8    STD009
9    STD010
Name: Student ID, dtype: object

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Student ID  10 non-null     object
 1   First Name  10 non-null     object
 2   Last Name   10 non-null     object
 3   Age         10 non-null     int64
 4   Grade       10 non-null     object
 5   Course      10 non-null     object
dtypes: int64(1), object(5)
memory usage: 612.0+ bytes

In [8]:
df.tail(2)

  Student ID First Name Last Name  Age Grade              Course
8     STD009      James    Taylor   19    B+           Economics
9     STD010     Rachel  Martinez   21     A  English Literature

In [7]:
df.head(3)

  Student ID First Name Last Name  Age Grade                   Course
0     STD001       John     Smith   20     A         Computer Science
1     STD002      Emily   Johnson   19    B+              Engineering
2     STD003    Michael  Williams   21    A-  Business Administration

In [4]:
df = pd.read_csv('students.csv')
df

  Student ID First Name Last Name  Age Grade                   Course
0     STD001       John     Smith   20     A         Computer Science
1     STD002      Emily   Johnson   19    B+              Engineering
2     STD003    Michael  Williams   21    A-  Business Administration
3     STD004      Sarah     Brown   20     A               Psychology
4     STD005      David    Miller   22     B              Mathematics
5     STD006    Jessica     Davis   19    A+                  Physics
6     STD007     Daniel  Anderson   21    B-                Chemistry
7     STD008       Lisa    Wilson   20    A-                  Biology
8     STD009      James    Taylor   19    B+                Economics
9     STD010     Rachel  Martinez   21     A       English Literature

In [2]:
pd.__version__

'2.2.3'

In [1]:
import pandas as pd